zwiebert/rv/esp32/netmcu/components/stm32_com/esp32/com_task.c
#include "app_config/proj_app_cfg.h"
#include "stm32_com/com_task.h"

#include "stm32/stm32.h"
#include "app/common.h"
#include "cli/cli.h"
#include "cli/mutex.h"
#include "esp_event.h"
#include "esp_log.h"
#include "esp_system.h"
#include "esp_wifi.h"
#include "freertos/FreeRTOS.h"
#include "freertos/event_groups.h"
#include "freertos/task.h"
#include "lwip/netdb.h"
#include "lwip/sockets.h"
#include "misc/int_types.h"
#include "net/http/server/http_server.h"
#include "net/tcp_cli_server.h"
#include "time.h"
#include "txtio/inout.h"
#include <errno.h>
#include <string.h>
#include <sys/select.h>

#define printf(...) io_printf_v(vrb3, __VA_ARGS__)
#define perror(s)   io_printf_v(vrb3, "%s: %s\n", s, strerror(errno))

#ifdef DISTRIBUTION
#define D(x)
#define DD(x)
#else
#define D(x) x
#define DD(x)
#endif




#define BUF_SIZE 512
static char line[BUF_SIZE];


static void do_work() {
  int c;

  int i = 0;

  for (i = 0; ((c = stm32_getc(true)) != '\n'); ++i) {
    if (c == -1)
      return; // looks like a timeout. throw away received data
    if (i + 2 >= BUF_SIZE)
      return;
    line[i] = c;
  }
  line[i] = '\0';
  D(printf("stm32com:recv: <%s>\n", line));

  if (watchDog_checkCommandLine(line))
    return;

  char *json = strstr(line, "{\"status\":");
  if (json && mutex_cliTake()) {
    cli_process_json(json, SO_TGT_ANY);
    mutex_cliGive();
  }

  char *reply = strstr(line, "{\"data\":");
  if (reply) {
    ws_print_json(reply);
    DD(printf("stm32com:recv:####REPLY####: <%s>\n", reply));
  }
}


static void stm32com_task(void *pvParameters) {
  for (;;) {
    do_work();
  }
}

static TaskHandle_t xHandle = NULL;
#define STACK_SIZE  3000

void stm32com_setup_task(const struct cfg_stm32com *cfg_stm32com) {
  static uint8_t ucParameterToPass;

  if (!cfg_stm32com || !cfg_stm32com->enable) {
    if (xHandle) {
      vTaskDelete(xHandle);
      xHandle = NULL;
    }
    return;
  }

  xTaskCreate(stm32com_task, "stm32com", STACK_SIZE, &ucParameterToPass, tskIDLE_PRIORITY, &xHandle);
  configASSERT( xHandle );

}


